import {toTransposed} from 'https://rpgen3.github.io/spatialFilter/mjs/util.mjs';
const kernelPrewitt = [
    -1, 0, 1,
    -1, 0, 1,
    -1, 0, 1
];
const kernelSobel = [
    -1, 0, 1,
    -2, 0, 2,
    -1, 0, 1
];
const kernelSobel5 = [
    -1, -2, 0, 2, 1,
    -4, -8, 0, 8, 4,
    -6, -12, 0,12, 6,
    -4, -8, 0, 8, 4,
    -1, -2, 0, 2, 1
];
export const kernel = {
    '平均値フィルタ(3x3)': Array(9).fill('1/9'),
    '平均値フィルタ(5x5)': Array(25).fill('1/25'),
    '平均値フィルタ(7x7)': Array(49).fill('1/49'),
    'ガウシアンフィルタ(3x3)': [
        1, 2, 1,
        2, 4, 2,
        1, 2, 1
    ].map(v => `${v}/16`),
    'ガウシアンフィルタ(5x5)': [
        1, 4, 6, 4, 1,
        4, 16, 24, 16, 4,
        6, 24, 36, 24, 6,
        4, 16, 24, 16, 4,
        1, 4, 6, 4, 1
    ].map(v => `${v}/256`),
    'ガウシアンフィルタ(7x7)': [
        1, 6, 15, 20, 15, 6, 1,
        6, 36, 90, 120, 90, 36, 6,
        15, 90, 225, 300, 225, 90, 15,
        20, 120, 300, 400, 300, 120, 20,
        15, 90, 225, 300, 225, 90, 15,
        6, 36, 90, 120, 90, 36, 6,
        1, 6, 15, 20, 15, 6, 1
    ].map(v => `${v}/4096`),
    'Robertsフィルタ(x方向)': [
        0, 0, 0,
        0, 1, 0,
        0, 0, -1
    ],
    'Robertsフィルタ(y方向)': [
        0, 0, 0,
        0, 0, 1,
        0, -1, 0
    ],
    'Prewittフィルタ(x方向)': kernelPrewitt,
    'Prewittフィルタ(y方向)': toTransposed(kernelPrewitt),
    'Sobelフィルタ(x方向)': kernelSobel,
    'Sobelフィルタ(y方向)': toTransposed(kernelSobel),
    'Sobelフィルタ(x方向)(5x5)': kernelSobel5,
    'Sobelフィルタ(y方向)(5x5)': toTransposed(kernelSobel5),
    'ラプラシアンフィルタ(4近傍)': [
        0, 1, 0,
        1, -4, 1,
        0, 1, 0
    ],
    'ラプラシアンフィルタ(8近傍)': [
        1, 1, 1,
        1, -8, 1,
        1, 1, 1
    ],
    '鮮鋭化フィルタ': [
        0, -1, 0,
        -1, 5, -1,
        0, -1, 0
    ],
    'LoGフィルタ': [
        0, 0, 1, 0, 0,
        0, 1, 2, 1, 0,
        1, 2, -16, 2, 1,
        0, 1, 2, 1, 0,
        0, 0, 1, 0, 0
    ]
};
